src/bsl/InformationRegisters/гкс_ДопустимыеМассыТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ДопустимыеМассыТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопустимаяМасса</Name>
					<Comment>Допустимая масса транспортного средства, тонн</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоличествоОсей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_КоличествоОсейТранспортногоСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ДопустимыеМассыТранспортныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет максимально допустимый вес в зависисмости от вида транспорта и количества осей
//
// Параметры:
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки -
//  КоличествоОсей  - ПеречислениеСсылка.гкс_КоличествоОсейТранспортногоСредства -
// 
// Возвращаемое значение:
//  ДопустимыйВес - Число -  значение допустимого веса
//
Функция МаксимальныйДопустимыйВес(ВидПеревозки, КоличествоОсей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДопустимыеМассыТранспортныхСредств.ДопустимаяМасса КАК ДопустимаяМасса
	|ИЗ
	|	РегистрСведений.гкс_ДопустимыеМассыТранспортныхСредств КАК ДопустимыеМассыТранспортныхСредств
	|ГДЕ
	|	ДопустимыеМассыТранспортныхСредств.ВидПеревозки = &ВидПеревозки
	|	И ДопустимыеМассыТранспортныхСредств.КоличествоОсей = &КоличествоОсей";
	
	Запрос.УстановитьПараметр("КоличествоОсей", КоличествоОсей);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.ДопустимаяМасса;
	Иначе	
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
